SoftwareDaddy/ESP32-BLE-CompositeHID/GamepadConfiguration.cpp
#include "GamepadConfiguration.h"

#if defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define LOG_TAG "GamepadConfiguration"
#else
#include "esp_log.h"
static const char *LOG_TAG = "GamepadConfiguration";
#endif

GamepadConfiguration::GamepadConfiguration() : 
    BaseCompositeDeviceConfiguration(GAMEPAD_REPORT_ID),
    _controllerType(CONTROLLER_TYPE_GAMEPAD),
    _buttonCount(16),
    _hatSwitchCount(1),
    _whichSpecialButtons{false, false, false, false, false, false, false, false},
    _whichAxes{true, true, true, true, true, true, true, true},
    _whichSimulationControls{false, false, false, false, false},
    _axesMin(0x0000),
    _axesMax(0x7FFF),
    _simulationMin(0x0000),
    _simulationMax(0x7FFF),
    _includeRumble(false)
{
}

const char* GamepadConfiguration::getDeviceName() {
    return GAMEPAD_DEVICE_NAME;
}

uint8_t GamepadConfiguration::getDeviceReportSize()
{
    uint8_t numOfButtonBytes = getButtonNumBytes();
    uint8_t numOfSpecialButtonBytes = getSpecialButtonNumBytes();
    uint8_t numOfAxisBytes = this->getAxisCount() * 2;
    uint8_t numOfSimulationBytes = this->getSimulationCount() * 2;

    uint8_t reportSize = numOfButtonBytes + numOfSpecialButtonBytes + numOfAxisBytes + numOfSimulationBytes + this->getHatSwitchCount();
    return reportSize;
}

size_t GamepadConfiguration::makeDeviceReport(uint8_t* buffer, size_t bufferSize)
{
    // Report description START -------------------------------------------------

    uint8_t tempHidReportDescriptor[BLE_ATT_ATTR_MAX_LEN];
    size_t reportSize = 0;

    // USAGE_PAGE (Generic Desktop)
    tempHidReportDescriptor[reportSize++] = USAGE_PAGE(1); //0x05;
    tempHidReportDescriptor[reportSize++] = 0x01; //Generic Desktop

    // USAGE (Joystick - 0x04; Gamepad - 0x05; Multi-axis Controller - 0x08)
    tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
    tempHidReportDescriptor[reportSize++] = this->getControllerType();

    // COLLECTION (Application)
    tempHidReportDescriptor[reportSize++] = COLLECTION(1); //0xa1;
    tempHidReportDescriptor[reportSize++] = 0x01;
    {
        // REPORT_ID (Gamepad)
        tempHidReportDescriptor[reportSize++] = REPORT_ID(1);
        tempHidReportDescriptor[reportSize++] = this->getReportId();

        if (this->getButtonCount() > 0)
        {
            // USAGE_PAGE (Button)
            tempHidReportDescriptor[reportSize++] = USAGE_PAGE(1); //0x05;
            tempHidReportDescriptor[reportSize++] = 0x09;

            // LOGICAL_MINIMUM (0)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MINIMUM(1);//0x15;
            tempHidReportDescriptor[reportSize++] = 0x00;

            // LOGICAL_MAXIMUM (1)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MAXIMUM(1); //0x25;
            tempHidReportDescriptor[reportSize++] = 0x01;

            // REPORT_SIZE (1)
            tempHidReportDescriptor[reportSize++] = REPORT_SIZE(1); //0x75;
            tempHidReportDescriptor[reportSize++] = 0x01;

            // USAGE_MINIMUM (Button 1)
            tempHidReportDescriptor[reportSize++] = USAGE_MINIMUM(1);//0x19;
            tempHidReportDescriptor[reportSize++] = 0x01;

            // USAGE_MAXIMUM (Up to 128 buttons possible)
            tempHidReportDescriptor[reportSize++] = USAGE_MAXIMUM(1);//0x29;
            tempHidReportDescriptor[reportSize++] = this->getButtonCount();

            // REPORT_COUNT (# of buttons)
            tempHidReportDescriptor[reportSize++] = REPORT_COUNT(1); //0x95;
            tempHidReportDescriptor[reportSize++] = this->getButtonCount();

            // INPUT (Data,Var,Abs)
            tempHidReportDescriptor[reportSize++] = HIDINPUT(1); //0x81;
            tempHidReportDescriptor[reportSize++] = 0x02;

            uint8_t buttonPaddingBits = getButtonNumPaddingBits();
            if (buttonPaddingBits > 0)
            {
                // REPORT_SIZE (1)
                tempHidReportDescriptor[reportSize++] = REPORT_SIZE(1); //0x75;
                tempHidReportDescriptor[reportSize++] = 0x01;

                // REPORT_COUNT (# of padding bits)
                tempHidReportDescriptor[reportSize++] = REPORT_COUNT(1); //0x95;
                tempHidReportDescriptor[reportSize++] = buttonPaddingBits;

                // INPUT (Const,Var,Abs)
                tempHidReportDescriptor[reportSize++] = HIDINPUT(1); //0x81;
                tempHidReportDescriptor[reportSize++] = 0x03;

            } // Padding Bits Needed

        } // Buttons

        if (this->getTotalSpecialButtonCount() > 0)
        {
            // LOGICAL_MINIMUM (0)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MINIMUM(1); //0x15;
            tempHidReportDescriptor[reportSize++] = 0x00;

            // LOGICAL_MAXIMUM (1)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MAXIMUM(1); //;0x25;
            tempHidReportDescriptor[reportSize++] = 0x01;

            // REPORT_SIZE (1)
            tempHidReportDescriptor[reportSize++] = REPORT_SIZE(1); //0x75;
            tempHidReportDescriptor[reportSize++] = 0x01;

            if (this->getDesktopSpecialButtonCount() > 0)
            {
                // USAGE_PAGE (Generic Desktop)
                tempHidReportDescriptor[reportSize++] = USAGE_PAGE(1); // 0x05;
                tempHidReportDescriptor[reportSize++] = 0x01;

                // REPORT_COUNT
                tempHidReportDescriptor[reportSize++] = REPORT_COUNT(1); //0x95;
                tempHidReportDescriptor[reportSize++] = this->getDesktopSpecialButtonCount();
                if (this->getIncludeStart())
                {
                    // USAGE (Start)
                    tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                    tempHidReportDescriptor[reportSize++] = 0x3D;
                }

                if (this->getIncludeSelect())
                {
                    // USAGE (Select)
                    tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                    tempHidReportDescriptor[reportSize++] = 0x3E;
                }

                if (this->getIncludeMenu())
                {
                    // USAGE (App Menu)
                    tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                    tempHidReportDescriptor[reportSize++] = 0x86;
                }

                // INPUT (Data,Var,Abs)
                tempHidReportDescriptor[reportSize++] = HIDINPUT(1); //0x81;
                tempHidReportDescriptor[reportSize++] = 0x02;
            }

            if (this->getConsumerSpecialButtonCount() > 0)
            {
                // USAGE_PAGE (Consumer Page)
                tempHidReportDescriptor[reportSize++] = USAGE_PAGE(1); //0x05;
                tempHidReportDescriptor[reportSize++] = 0x0C;

                // REPORT_COUNT
                tempHidReportDescriptor[reportSize++] = REPORT_COUNT(1); //0x95;
                tempHidReportDescriptor[reportSize++] = this->getConsumerSpecialButtonCount();

                if (this->getIncludeHome())
                {
                    // USAGE (Home)
                    tempHidReportDescriptor[reportSize++] = USAGE(2); //0x0A;
                    tempHidReportDescriptor[reportSize++] = 0x23;
                    tempHidReportDescriptor[reportSize++] = 0x02;
                }

                if (this->getIncludeBack())
                {
                    // USAGE (Back)
                    tempHidReportDescriptor[reportSize++] = USAGE(2); //0x0A;
                    tempHidReportDescriptor[reportSize++] = 0x24;
                    tempHidReportDescriptor[reportSize++] = 0x02;
                }

                if (this->getIncludeVolumeInc())
                {
                    // USAGE (Volume Increment)
                    tempHidReportDescriptor[reportSize++] =  USAGE(1); //0x09;
                    tempHidReportDescriptor[reportSize++] = 0xE9;
                }

                if (this->getIncludeVolumeDec())
                {
                    // USAGE (Volume Decrement)
                    tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                    tempHidReportDescriptor[reportSize++] = 0xEA;
                }

                if (this->getIncludeVolumeMute())
                {
                    // USAGE (Mute)
                    tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                    tempHidReportDescriptor[reportSize++] = 0xE2;
                }

                // INPUT (Data,Var,Abs)
                tempHidReportDescriptor[reportSize++] = HIDINPUT(1); //0x81;
                tempHidReportDescriptor[reportSize++] = 0x02;
            }

            uint8_t specialButtonPaddingBits = getSpecialButtonNumPaddingBits();
            if (specialButtonPaddingBits > 0)
            {
                // REPORT_SIZE (1)
                tempHidReportDescriptor[reportSize++] = REPORT_SIZE(1); //0x75;
                tempHidReportDescriptor[reportSize++] = 0x01;

                // REPORT_COUNT (# of padding bits)
                tempHidReportDescriptor[reportSize++] = REPORT_COUNT(1); //0x95;
                tempHidReportDescriptor[reportSize++] = specialButtonPaddingBits;

                // INPUT (Const,Var,Abs)
                tempHidReportDescriptor[reportSize++] = HIDINPUT(1); //0x81;
                tempHidReportDescriptor[reportSize++] = 0x03;

            } // Padding Bits Needed

