SoftwareDaddy/ESP32-BLE-CompositeHID/GamepadConfiguration.cpp
        } // Special Buttons

        if (this->getAxisCount() > 0)
        {
            // USAGE_PAGE (Generic Desktop)
            tempHidReportDescriptor[reportSize++] = USAGE_PAGE(1); 0x05;
            tempHidReportDescriptor[reportSize++] = 0x01; // Generic desktop controls

            // USAGE (Pointer)
            tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
            tempHidReportDescriptor[reportSize++] = 0x01; 

            // LOGICAL_MINIMUM (-32767)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MINIMUM(2); //0x16;
            tempHidReportDescriptor[reportSize++] = lowByte(this->getAxesMin());
            tempHidReportDescriptor[reportSize++] = highByte(this->getAxesMin());
            //tempHidReportDescriptor[reportSize++] = 0x00;		// Use these two lines for 0 min
            //tempHidReportDescriptor[reportSize++] = 0x00;
                //tempHidReportDescriptor[reportSize++] = 0x01;	// Use these two lines for -32767 min
            //tempHidReportDescriptor[reportSize++] = 0x80;

            // LOGICAL_MAXIMUM (+32767)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MAXIMUM(2);//0x26;
            tempHidReportDescriptor[reportSize++] = lowByte(this->getAxesMax());
            tempHidReportDescriptor[reportSize++] = highByte(this->getAxesMax());
            //tempHidReportDescriptor[reportSize++] = 0xFF;	// Use these two lines for 255 max
            //tempHidReportDescriptor[reportSize++] = 0x00;
                //tempHidReportDescriptor[reportSize++] = 0xFF;	// Use these two lines for +32767 max
            //tempHidReportDescriptor[reportSize++] = 0x7F;

            // REPORT_SIZE (16)
            tempHidReportDescriptor[reportSize++] = REPORT_SIZE(1); //0x75;
            tempHidReportDescriptor[reportSize++] = 0x10;

            // REPORT_COUNT (this->getAxisCount())
            tempHidReportDescriptor[reportSize++] = REPORT_COUNT(1); //0x95;
            tempHidReportDescriptor[reportSize++] = this->getAxisCount();

            // COLLECTION (Physical)
            tempHidReportDescriptor[reportSize++] = COLLECTION(1); //0xA1;
            tempHidReportDescriptor[reportSize++] = 0x00;

            if (this->getIncludeXAxis())
            {
                // USAGE (X)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0x30;
            }

            if (this->getIncludeYAxis())
            {
                // USAGE (Y)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0x31;
            }

            if (this->getIncludeZAxis())
            {
                // USAGE (Z)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0x32;
            }

            if (this->getIncludeRzAxis())
            {
                // USAGE (Rz)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0x35;
            }

            if (this->getIncludeRxAxis())
            {
                // USAGE (Rx)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0x33;
            }

            if (this->getIncludeRyAxis())
            {
                // USAGE (Ry)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0x34;
            }

            if (this->getIncludeSlider1())
            {
                // USAGE (Slider)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0x36;
            }

            if (this->getIncludeSlider2())
            {
                // USAGE (Slider)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0x36;
            }

            // INPUT (Data,Var,Abs)
            tempHidReportDescriptor[reportSize++] = HIDINPUT(1); //0x81;
            tempHidReportDescriptor[reportSize++] = 0x02;

            // END_COLLECTION (Physical)
            tempHidReportDescriptor[reportSize++] = END_COLLECTION(0); //0xc0;

        } // X, Y, Z, Rx, Ry, and Rz Axis

        if (this->getSimulationCount() > 0)
        {
            // USAGE_PAGE (Simulation Controls)
            tempHidReportDescriptor[reportSize++] = USAGE_PAGE(1); //0x05;
            tempHidReportDescriptor[reportSize++] = 0x02;

            // LOGICAL_MINIMUM (-32767)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MINIMUM(2); //0x16;
            tempHidReportDescriptor[reportSize++] = lowByte(this->getSimulationMin());
            tempHidReportDescriptor[reportSize++] = highByte(this->getSimulationMin());
            //tempHidReportDescriptor[reportSize++] = 0x00;		// Use these two lines for 0 min
            //tempHidReportDescriptor[reportSize++] = 0x00;
            //tempHidReportDescriptor[reportSize++] = 0x01;	    // Use these two lines for -32767 min
            //tempHidReportDescriptor[reportSize++] = 0x80;

            // LOGICAL_MAXIMUM (+32767)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MAXIMUM(2); //0x26;
            tempHidReportDescriptor[reportSize++] = lowByte(this->getSimulationMax());
            tempHidReportDescriptor[reportSize++] = highByte(this->getSimulationMax());
            //tempHidReportDescriptor[reportSize++] = 0xFF;	    // Use these two lines for 255 max
            //tempHidReportDescriptor[reportSize++] = 0x00;
            //tempHidReportDescriptor[reportSize++] = 0xFF;		// Use these two lines for +32767 max
            //tempHidReportDescriptor[reportSize++] = 0x7F;

            // REPORT_SIZE (16)
            tempHidReportDescriptor[reportSize++] = REPORT_SIZE(1); //0x75;
            tempHidReportDescriptor[reportSize++] = 0x10;

            // REPORT_COUNT (this->getSimulationCount())
            tempHidReportDescriptor[reportSize++] = REPORT_COUNT(1); //0x95;
            tempHidReportDescriptor[reportSize++] = this->getSimulationCount();

            // COLLECTION (Physical)
            tempHidReportDescriptor[reportSize++] = COLLECTION(1); //0xA1;
            tempHidReportDescriptor[reportSize++] = 0x00;

            if (this->getIncludeRudder())
            {
                // USAGE (Rudder)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0xBA;
            }

            if (this->getIncludeThrottle())
            {
                // USAGE (Throttle)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0xBB;
            }

            if (this->getIncludeAccelerator())
            {
                // USAGE (Accelerator)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0xC4;
            }

