SoftwareDaddy/ESP32-BLE-CompositeHID/GamepadConfiguration.cpp
            if (this->getIncludeBrake())
            {
                // USAGE (Brake)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0xC5;
            }

            if (this->getIncludeSteering())
            {
                // USAGE (Steering)
                tempHidReportDescriptor[reportSize++] = USAGE(1); //0x09;
                tempHidReportDescriptor[reportSize++] = 0xC8;
            }

            // INPUT (Data,Var,Abs)
            tempHidReportDescriptor[reportSize++] = HIDINPUT(1); 0x81;
            tempHidReportDescriptor[reportSize++] = 0x02;

            // END_COLLECTION (Physical)
            tempHidReportDescriptor[reportSize++] = END_COLLECTION(0); //0xc0;

        } // Simulation Controls

        if (this->getHatSwitchCount() > 0)
        {

            // COLLECTION (Physical)
            tempHidReportDescriptor[reportSize++] = COLLECTION(1); //0xA1;
            tempHidReportDescriptor[reportSize++] = 0x00;

            // USAGE_PAGE (Generic Desktop)
            tempHidReportDescriptor[reportSize++] = USAGE_PAGE(1);
            tempHidReportDescriptor[reportSize++] = 0x01;

            // USAGE (Hat Switch)
            for (int currentHatIndex = 0; currentHatIndex < this->getHatSwitchCount(); currentHatIndex++)
            {
                tempHidReportDescriptor[reportSize++] = USAGE(1);
                tempHidReportDescriptor[reportSize++] = 0x39;
            }

            // Logical Min (1)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MINIMUM(1); //0x15;
            tempHidReportDescriptor[reportSize++] = 0x01;

            // Logical Max (8)
            tempHidReportDescriptor[reportSize++] = LOGICAL_MAXIMUM(1); //0x25;
            tempHidReportDescriptor[reportSize++] = 0x08;

            // Physical Min (0)
            tempHidReportDescriptor[reportSize++] = PHYSICAL_MINIMUM(1); //0x35;
            tempHidReportDescriptor[reportSize++] = 0x00;

            // Physical Max (315)
            tempHidReportDescriptor[reportSize++] = PHYSICAL_MAXIMUM(2); //0x46;
            tempHidReportDescriptor[reportSize++] = 0x3B;
            tempHidReportDescriptor[reportSize++] = 0x01;

            // Unit (SI Rot : Ang Pos)
            tempHidReportDescriptor[reportSize++] = UNIT(1); //0x65;
            tempHidReportDescriptor[reportSize++] = 0x12;

            // Report Size (8)
            tempHidReportDescriptor[reportSize++] = REPORT_SIZE(1); //0x75;
            tempHidReportDescriptor[reportSize++] = 0x08;

            // Report Count (4)
            tempHidReportDescriptor[reportSize++] = REPORT_COUNT(1); //0x95;
            tempHidReportDescriptor[reportSize++] = this->getHatSwitchCount();

            // Input (Data, Variable, Absolute)
            tempHidReportDescriptor[reportSize++] = HIDINPUT(1); //0x81;
            tempHidReportDescriptor[reportSize++] = 0x42;

            // END_COLLECTION (Physical)
            tempHidReportDescriptor[reportSize++] = END_COLLECTION(0); //0xc0;
        }

        if(this->getIncludeRumble()){
            ESP_LOGI(LOG_TAG, "Start offset: %d, Bytes to copy: %d, Final size: %d", reportSize, sizeof(pidReportDescriptor), reportSize + sizeof(pidReportDescriptor));
            memcpy(&tempHidReportDescriptor[reportSize], &pidReportDescriptor[0], sizeof(pidReportDescriptor));
            reportSize += sizeof(pidReportDescriptor) / sizeof(pidReportDescriptor[0]);
        }
    }
    
    // End gamepad collection
    tempHidReportDescriptor[reportSize++] = END_COLLECTION(0); //0xc0;
    
    if(reportSize < bufferSize){
        memcpy(buffer, tempHidReportDescriptor, reportSize);
    } else {
        return -1;
    }

    return reportSize;
}


uint8_t GamepadConfiguration::getTotalSpecialButtonCount()
{
    int count = 0;
    for (int i = 0; i < POSSIBLESPECIALBUTTONS; i++)
    {
        count += (int)_whichSpecialButtons[i];
    }

    return count;
}

uint8_t GamepadConfiguration::getDesktopSpecialButtonCount()
{
    int count = 0;
    for (int i = 0; i < 3; i++)
    {
        count += (int)_whichSpecialButtons[i];
    }

    return count;
}

uint8_t GamepadConfiguration::getConsumerSpecialButtonCount()
{
    int count = 0;
    for (int i = 3; i < 8; i++)
    {
        count += (int)_whichSpecialButtons[i];
    }

    return count;
}

uint8_t GamepadConfiguration::getAxisCount()
{
    int count = 0;
    for (int i = 0; i < POSSIBLEAXES; i++)
    {
        count += (int)_whichAxes[i];
    }

    return count;
}

uint8_t GamepadConfiguration::getSimulationCount()
{
    int count = 0;
    for (int i = 0; i < POSSIBLESIMULATIONCONTROLS; i++)
    {
        count += (int)_whichSimulationControls[i];
    }

    return count;
}

uint16_t GamepadConfiguration::getButtonCount() { return _buttonCount; }
uint8_t GamepadConfiguration::getHatSwitchCount() { return _hatSwitchCount; }
int16_t GamepadConfiguration::getAxesMin(){ return _axesMin; }
int16_t GamepadConfiguration::getAxesMax(){ return _axesMax; }
int16_t GamepadConfiguration::getSimulationMin(){ return _simulationMin; }
int16_t GamepadConfiguration::getSimulationMax(){ return _simulationMax; }
uint8_t GamepadConfiguration::getControllerType() { return _controllerType; }
bool GamepadConfiguration::getIncludeStart() { return _whichSpecialButtons[START_BUTTON]; }
bool GamepadConfiguration::getIncludeSelect() { return _whichSpecialButtons[SELECT_BUTTON]; }
bool GamepadConfiguration::getIncludeMenu() { return _whichSpecialButtons[MENU_BUTTON]; }
bool GamepadConfiguration::getIncludeHome() { return _whichSpecialButtons[HOME_BUTTON]; }
bool GamepadConfiguration::getIncludeBack() { return _whichSpecialButtons[BACK_BUTTON]; }
bool GamepadConfiguration::getIncludeVolumeInc() { return _whichSpecialButtons[VOLUME_INC_BUTTON]; }
bool GamepadConfiguration::getIncludeVolumeDec() { return _whichSpecialButtons[VOLUME_DEC_BUTTON]; }
bool GamepadConfiguration::getIncludeVolumeMute() { return _whichSpecialButtons[VOLUME_MUTE_BUTTON]; }
const bool *GamepadConfiguration::getWhichSpecialButtons() const { return _whichSpecialButtons; }
bool GamepadConfiguration::getIncludeXAxis() { return _whichAxes[X_AXIS]; }
bool GamepadConfiguration::getIncludeYAxis() { return _whichAxes[Y_AXIS]; }
bool GamepadConfiguration::getIncludeZAxis() { return _whichAxes[Z_AXIS]; }
bool GamepadConfiguration::getIncludeRxAxis() { return _whichAxes[RX_AXIS]; }
bool GamepadConfiguration::getIncludeRyAxis() { return _whichAxes[RY_AXIS]; }
bool GamepadConfiguration::getIncludeRzAxis() { return _whichAxes[RZ_AXIS]; }
bool GamepadConfiguration::getIncludeSlider1() { return _whichAxes[SLIDER1]; }
bool GamepadConfiguration::getIncludeSlider2() { return _whichAxes[SLIDER2]; }
const bool *GamepadConfiguration::getWhichAxes() const { return _whichAxes; }
bool GamepadConfiguration::getIncludeRudder() { return _whichSimulationControls[RUDDER]; }
bool GamepadConfiguration::getIncludeThrottle() { return _whichSimulationControls[THROTTLE]; }
bool GamepadConfiguration::getIncludeAccelerator() { return _whichSimulationControls[ACCELERATOR]; }
bool GamepadConfiguration::getIncludeBrake() { return _whichSimulationControls[BRAKE]; }
bool GamepadConfiguration::getIncludeSteering() { return _whichSimulationControls[STEERING]; }
const bool *GamepadConfiguration::getWhichSimulationControls() const { return _whichSimulationControls; }
bool GamepadConfiguration::getIncludeRumble() { return _includeRumble; }
void GamepadConfiguration::setIncludeRumble(bool value) { _includeRumble = value; }

void GamepadConfiguration::setWhichSpecialButtons(bool start, bool select, bool menu, bool home, bool back, bool volumeInc, bool volumeDec, bool volumeMute)
{
    _whichSpecialButtons[START_BUTTON] = start;
    _whichSpecialButtons[SELECT_BUTTON] = select;
    _whichSpecialButtons[MENU_BUTTON] = menu;
    _whichSpecialButtons[HOME_BUTTON] = home;
    _whichSpecialButtons[BACK_BUTTON] = back;
    _whichSpecialButtons[VOLUME_INC_BUTTON] = volumeInc;
    _whichSpecialButtons[VOLUME_DEC_BUTTON] = volumeDec;
    _whichSpecialButtons[VOLUME_MUTE_BUTTON] = volumeMute;
}

void GamepadConfiguration::setWhichAxes(bool xAxis, bool yAxis, bool zAxis, bool rxAxis, bool ryAxis, bool rzAxis, bool slider1, bool slider2)
{
    _whichAxes[X_AXIS] = xAxis;
    _whichAxes[Y_AXIS] = yAxis;
    _whichAxes[Z_AXIS] = zAxis;
    _whichAxes[RX_AXIS] = rxAxis;
    _whichAxes[RY_AXIS] = ryAxis;
    _whichAxes[RZ_AXIS] = rzAxis;
    _whichAxes[SLIDER1] = slider1;
    _whichAxes[SLIDER2] = slider2;
}

